<template>
    <div class="container">
        <div class="header m-4">
            <h1 class="m-4">About</h1>
            <p><i>Данный органайзер содержит несколько независимых приложений:</i></p>
        </div>
        
                  <!-- Reminder -->
        <div class="header mt-4"><h3>Reminder</h3></div>        

        <p>Приложение Reminder напоминает пользователю о приближающихся событиях, 
            которые повторяются каждый год или месяц (дни рождения, платежи за страховку, квартиру, интернет и т.д.)
            Так же в приложение можно задать уникальное событие, которое удаляется из базы после потери его актуальности при нажатии зеленой кнопки. Приложение состоит из двух страниц:</p>

        <p class="offset"><b>Home</b> - содержит четыре таблицы:
            <ul>
                <li>"просроченные",</li>
                <li>"сегодня",</li>
                <li>"завтра",</li>
                <li>"на неделе".</li>
            </ul>
        </p>
        <p class="offset">В этих таблицах можно удалять события красной кнопкой, редактировать синей, 
                а так же переносить события на следующий месяц или год при нажатии на зеленую кнопку с галочкой. 
                Если событие установлено как "unique", при нажатии на зеленую кнопку будет удалено.</p>
        <p class="offset"><b>Events</b> - содержит одну таблицу со всеми событиями. На этой странице можно просмотреть все события и добавить новое, отредактировать или удалить.</p>

        <hr>


            <!-- To-do list --> 
            <div class="header mt-4"><h3>To-do list</h3></div>          

        <p>Приложение помогает пользователю составить и сохранить список задач. Приложение состоит из одной таблицы:</p>   

        <p class="offset"><b>Tasks</b> - В этой таблице можно удалять задачи красной кнопкой, сортировать по важности, присвоив задаче рейтинг от 0 до 5, зачеркивать выполненные. </p>        


        <hr>

            <!-- Companies --> 
            <div class="header mt-4"><h3>Companies</h3> </div>        

        <p>Неуверен что данное приложение будет кому то интересно, но мне лично захотелось создать его, 
            т.к начинаю поиски первой работы и хочу вести журнал об общении и результатах с IT-компаниями. 
            Насколько я знаю что первую работу новичку найти очень трудно и попыток будет много. 
            Это приложение мне поможет не запутаться в каких компаниях я делал тесты и был на собеседованиях. Приложение состоит из двух страниц:</p>

        <p class="offset"><b>Companies</b> - содержит список компаний и кнопки для создания новых, редактирования имеющихся и удаления.
            При клике на одну из компаний открывается отдельная страница "Company".  </p>
               
        <p class="offset"><b>Company</b> - содержит название, описание компании, а также список тестов или собеседований прошедших в данной компании. 
            В списке также имеются кнопки добавления, редактирования и удаления тестов или собеседований.</p>
        <hr>


        <h2 class="header m-4"><i>Использование</i></h2>

        <p>Для регистрации в приложении выполните следующие действия:</p>

        <ul>
            <li>Нажмите "register" на панели навигации.</li>
            <li>Введите ваше Имя, E-mail, пароль и нажмите "Save".</li>
            <li>После регистрации откроется форма "Login", где введите ваши E-mail и пароль.</li>
            <li>
                Если вы уже зарегистрированы, для начала пользования приложением:
                <ul>
                    <li>Нажмите "login" на панели навигации.</li>
                    <li>Введите в открывшейся форме ваш email и пароль.</li>
                    <li>Для выхода из учетной записи нажмите "logout"</li>
                </ul>
            </li>
        </ul>

        <h4>Reminder</h4>

        <p>Чтобы создать событие для напоминания:</p>

        <ul>
            <li>Нажмите "Events" на панели навигации.</li>
            <li>В открывшейся странице нажмите "new Event".</li>
            <li>В открывшейся форме заполните все поля и нажмите "Save".</li>
        </ul>


        <h4>To-do list</h4>

        <p>Чтобы создать новую задачу:</p>

        <ul>
            <li>Нажмите "To-do list" на панели навигации.</li>
            <li>Введите название задачи в поле и нажмите "Enter".</li>
            <li>Для редактирования задачи, нажмите на нее и отредактируйте, после чего нажмите "Enter".</li>
        </ul>


        <h4>Companies</h4>

        <p>Чтобы Добавить новую компанию:</p>

        <ul>
            <li>Нажмите "Companies" на панели навигации.</li>
            <li>В открывшейся странице нажмите "new Company" чтобы добавить компанию в список.</li>
            <li>Кликните название компании и в открышвейся странице нажмите "new Test" чтобы добавить тест или собеседование в список.</li>
            <li>Кликние название теста или собеседования чтобы посмотреть описание.</li>
        </ul>

        <hr>

        <p>Для максимально эфективного использования данного приложения рекомендуется:</p>
                            
        <ul>
            <li>
                Cоздать файл с расширением .html и поместить в него следующимй код:
                <img class="m-2" src="About_html_code.png" alt="">
            </li>
            <li>В качестве значения ключа location поставьте ссылку на адрес где находится ваш сайт "Reminder"</li>
            <li>Поместите этот файл в папку "Автозагрузка" на вашем компьютере.</li>
        </ul>

        <p>Поздравляю!</p>
        <p>Теперь после включения компьютера, ваше приложение Reminder будет автоматически запускаться и выводить напоминания на ваш экран!</p>  
            <hr>
            <p class="m-4 p-4">Приложение в состоянии разработки.... 2021</p>                          
    </div>

</template>

<script>
export default {

}
</script>

<style scoped>
.container {
    font-family: 'Segoe UI', Tahoma, Verdana, sans-serif;
    font-size: 18px;
}
h3 {
    font-weight: 600;
}

h4 {
    font-weight: 600;
}

.header {
    text-align: center;
}
.offset {
    padding-left: 20px;
}
</style>